src/meas.org
# -*- Mode:Org; Coding:utf-8; fill-column:158 -*-
#+TITLE:       free42 Repeated Measurements
#+AUTHOR:      Mitch Richling
#+EMAIL:       http://www.mitchr.me/
#+DATE:        2021-03-24
#+DESCRIPTION: Description of some free42/hp-42s/DM42 programs repeated measurements and uncertainty reporting
#+LANGUAGE:    en
#+OPTIONS:     num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t skip:nil d:nil todo:t pri:nil H:5 p:t author:t html-scripts:nil
#+HTML_HEAD: <style>body { width: 95%; margin: 2% auto; font-size: 18px; line-height: 1.4em; font-family: Georgia, serif; color: black; background-color: white; }</style>
#+HTML_HEAD: <style>body { min-width: 500px; max-width: 1024px; }</style>
#+HTML_HEAD: <style>h1,h2,h3,h4,h5,h6 { color: #A5573E; line-height: 1em; font-family: Helvetica, sans-serif; }</style>
#+HTML_HEAD: <style>h1,h2,h3 { line-height: 1.4em; }</style>
#+HTML_HEAD: <style>h1.title { font-size: 3em; }</style>
#+HTML_HEAD: <style>h4,h5,h6 { font-size: 1em; }</style>
#+HTML_HEAD: <style>.org-src-container { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; font-family: Lucida Console, monospace; font-size: 80%; margin: 0px; padding: 0px 0px; position: relative; }</style>
#+HTML_HEAD: <style>.org-src-container>pre { line-height: 1.2em; padding-top: 1.5em; margin: 0.5em; background-color: #404040; color: white; overflow: auto; }</style>
#+HTML_HEAD: <style>.org-src-container>pre:before { display: block; position: absolute; background-color: #b3b3b3; top: 0; right: 0; padding: 0 0.2em 0 0.4em; border-bottom-left-radius: 8px; border: 0; color: white; font-size: 100%; font-family: Helvetica, sans-serif;}</style>
#+HTML_HEAD: <style>pre.example { white-space: pre-wrap; white-space: -moz-pre-wrap; white-space: -o-pre-wrap; font-family: Lucida Console, monospace; font-size: 80%; background: #404040; color: white; display: block; padding: 0em; border: 2px solid black; }</style>
#+HTML_LINK_HOME: https://www.mitchr.me/
#+HTML_LINK_UP: https://richmit.github.io/hp42/
#+EXPORT_FILE_NAME: ../docs/meas

#+ATTR_HTML: :border 2 solid #ccc :frame hsides :align center
|        <r> | <l>              |
|  *Author:* | /{{{author}}}/ |
| *Updated:* | /{{{time(%Y-%m-%d %H:%M:%S)}}}/ |
#+ATTR_HTML: :align center
Copyright {{{time(%Y)}}} Mitch Richling. All rights reserved.

#+TOC: headlines 5

#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #
#   00   #    10   #    20   #    30   #    40   #    50   #    60   #    70   #    80   #    90   #   100   #   110   #   120   #   130   #   140   #   150   #   160   #
# 234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789
#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #
#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #

* Metadata

This home for this HTML file is: https://richmit.github.io/hp42/meas.html

Files related to this document may be found on github: https://github.com/richmit/hp42

Directory contents:
#+ATTR_HTML: :border 0 :frame none :rules none :align center
   | =src=     | - | The org-mode file that generated this HTML document            |
   | =src_42s= | - | Ready to convert source listings for 42s code in this document |
   | =docs=    | - | This html document                                             |
   | =bin=     | - | Importable RAW program files                                   |

* Introduction

I frequently take repeated measurements, but don't feel the need to record all the measurements in my laboratory notebook.  For example, when working on my
stamp collection I will measure stamp thickness at 5 locations and use the average value.  The application described below is designed to make that process
more automated and less error prone.

* Supported Methods

When estimating & reporting measurement uncertainty, two methods are most common.  The first assumes the measurements are statistically independent and
normally distributed.  In this case the measurement is taken to be the mean, and the standard uncertainty (u) is defined as the population standard deviation.  The
second method assumes a rectangular error distribution.  In this case the measurement is assumed to be the midrange=(max+min)/2, and the standard uncertainty is
defined as u=(max-min)/(2*sqrt(3)).  In both schemes the standard uncertainty is frequently "expanded" by a factor (k) in order to provide a probabilistic uncertainty
interval or confidence interval.

Other schemes are frequently used, and the application provides raw statistics to compute many of them: mean, midrange, range, standard deviation, population
standard deviation, number of observations, sum, & sum of squares.

* Setup

The last menu provides configuration options.

** Distribution

The distribution to be used in reports is set via the first menu button -- the current selection is displayed in the menu label (N=Normal & S=Square).  This
key cycles between normal and rectangular distributions when pressed.  Note that it also defaults the coverage factor (the second menu button)!

** Coverage Factors

The coverage factor used to compute the expanded uncertainty is set via the second menu key.  Repeatedly pressing this button will cycle through predefined
values appropriate for the already selected distribution.

This option is used both for reports and the expanded uncertainty computations on the second menu page (=[kuN]= & =[kuS]=).  It is not possible to set the
coverage factor to an arbitrary value; however, the population standard deviation (=[PSD]=) and rectangular variance (=[SqVA]=)are in the third menu.

For normally distributed errors the following coverage factors are supported.

#+ATTR_HTML: :align center
| Confidence % | Coverage Factor |
|--------------+-----------------|
|        68.27 |               1 |
|        95.45 |               2 |
|        99.73 |               3 |

For errors with a rectangular distribution the following coverage factors are supported.

#+ATTR_HTML: :align center
| Coverage Factor  | Key label |
|-----------------+-----------|
|               1 |           |
|   1.73205080757 | √3        |

** Automatic Reporting

A report can be generated upon entering a specified number of measurements.  This is very handy when a batch of items needs to be measured, and one wishes to
do a fixed number of measurements per item.  To set the automatic report count provide an integer in X, and use this menu key.  The current value is displayed
as part of the menu label.  A dash (-) means no automatic reporting is configured.  Use zero to turn off reporting.

