docs/meas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-30 Tue 17:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>free42/hp42s/DM42 Repeated Measurements</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Description of some free42/hp-42s/DM42 programs repeated measurements and uncertainty reporting"
 />











</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/hp42/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">free42/hp42s/DM42 Repeated Measurements</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-03-30 17:50:49</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org015d3fc">1. Metadata</a></li>
<li><a href="#orga862904">2. Introduction</a></li>
<li><a href="#orgc9e603d">3. Supported Methods</a></li>
<li><a href="#org487a126">4. Setup</a>
<ul>
<li><a href="#orga6dfe85">4.1. Distribution</a></li>
<li><a href="#org0646d2f">4.2. Coverage Factors</a></li>
<li><a href="#org19c2579">4.3. Automatic Reporting</a></li>
</ul>
</li>
<li><a href="#org6b89740">5. Reporting</a></li>
<li><a href="#orgc30f56a">6. Application Menu</a></li>
<li><a href="#org63e9554">7. Use</a></li>
<li><a href="#org467db72">8. Future</a></li>
<li><a href="#org21c788e">9. The Code</a></li>
<li><a href="#orgb0b5a22">10. Median</a></li>
</ul>
</div>
</div>

<div id="outline-container-org015d3fc" class="outline-2">
<h2 id="org015d3fc"><span class="section-number-2">1</span> Metadata</h2>
<div class="outline-text-2" id="text-1">
<p>
This home for this HTML file is: <a href="https://richmit.github.io/hp42/meas.html">https://richmit.github.io/hp42/meas.html</a>
</p>

<p>
Files related to this document may be found on github: <a href="https://github.com/richmit/hp42">https://github.com/richmit/hp42</a>
</p>

<ul class="org-ul">
<li><code>src</code> directory: Contains the org-mode file that generated this HTML document</li>
<li><code>docs</code> directory: Contains this html document</li>
<li><code>bin</code> directory: Contains raw program files</li>
</ul>
</div>
</div>

<div id="outline-container-orga862904" class="outline-2">
<h2 id="orga862904"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
I frequently take repeated measurements, but don't feel the need to record all the measurements in my laboratory notebook.  For example, when working on my
stamp collection I will measure stamp thickness at 5 locations and use the average value.  The application described below is designed to make that process
more automated and less error prone.
</p>
</div>
</div>

<div id="outline-container-orgc9e603d" class="outline-2">
<h2 id="orgc9e603d"><span class="section-number-2">3</span> Supported Methods</h2>
<div class="outline-text-2" id="text-3">
<p>
When estimating &amp; reporting measurement uncertainty, two methods are most common.  The first assumes the measurements are statistically independent and
normally distributed.  In this case the measurement is taken to be the mean, and the standard uncertainty (u) is defined as the population standard deviation.  The
second method assumes a rectangular error distribution.  In this case the measurement is assumed to be the midrange=(max+min)/2, and the standard uncertainty is
defined as u=(max-min)/(2*sqrt(3)).  In both schemes the standard uncertainty is frequently "expanded" by a factor (k) in order to provide a probabilistic uncertainty
interval or confidence interval.
</p>

<p>
Other schemes are frequently used, and the application provides raw statistics to compute many of them: mean, midrange, range, standard deviation, population
standard deviation, number of observations, sum, &amp; sum of squares.
</p>
</div>
</div>

<div id="outline-container-org487a126" class="outline-2">
<h2 id="org487a126"><span class="section-number-2">4</span> Setup</h2>
<div class="outline-text-2" id="text-4">
<p>
The last menu provides configuration options.
</p>
</div>

<div id="outline-container-orga6dfe85" class="outline-3">
<h3 id="orga6dfe85"><span class="section-number-3">4.1</span> Distribution</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The distribution to be used in reports is set via the first menu button &#x2013; the current selection is displayed in the menu label (N=Normal &amp; S=Square).  This
key cycles between normal and rectangular distributions when pressed.  Note that it also defaults the coverage factor (the second menu button)!
</p>
</div>
</div>

<div id="outline-container-org0646d2f" class="outline-3">
<h3 id="org0646d2f"><span class="section-number-3">4.2</span> Coverage Factors</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The coverage factor used to compute the expanded uncertainty is set via the second menu key.  Repeatedly pressing this button will cycle through predefined
values appropriate for the already selected distribution.
</p>

<p>
This option is used both for reports and the expanded uncertainty computations on the second menu page (<code>[kuN]</code> &amp; <code>[kuS]</code>).  It is not possible to set the
coverage factor to an arbitrary value; however, the population standard deviation (<code>[PSD]</code>) and rectangular variance (<code>[SqVA]</code>)are in the third menu.
</p>

<p>
For normally distributed errors the following coverage factors are supported.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Confidence %</th>
<th scope="col" class="org-right">Coverage Factor</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">68.27</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">95.45</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">99.73</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>

<p>
For errors with a rectangular distribution the following coverage factors are supported.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Coverage Factor</th>
<th scope="col" class="org-left">Key label</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">1.73205080757</td>
<td class="org-left">√3</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org19c2579" class="outline-3">
<h3 id="org19c2579"><span class="section-number-3">4.3</span> Automatic Reporting</h3>
<div class="outline-text-3" id="text-4-3">
<p>
A report can be generated upon entering a specified number of measurements.  This is very handy when a batch of items needs to be measured, and one wishes to
do a fixed number of measurements per item.  To set the automatic report count provide an integer in X, and use this menu key.  The current value is displayed
as part of the menu label.  A dash (-) means no automatic reporting is configured.  Use zero to turn off reporting.
</p>
</div>
</div>
</div>
