src/meas.org
* Reporting

I find that most of the time I use units such that measurements integer values.  For example with paper thickness measurements I will use micrometers in a
range between 700 and 1100.  For other philatelic applications I may use millimeters with one or, rarely, two decimals.  For these applications it is possible
to fit the measurement value, uncertainty, max, and min all on the screen at once assuming =FIX= has been set appropriately.  The report function attempts to
use this compact reporting method if possible.  Otherwise it uses the first line for the measurement estimate and the second line for the expanded
uncertainty.

The measurement and expanded uncertainty are reported according to the selected of distribution and coverage factor.  See the setup menu.

Reports can be automatically generated upon entry of a configurable number of measurements.  See the setup menu.

* Application Menu

#+ATTR_HTML: :align center
#+NAME: measm
|------+-------------------------------+-----------------------------------------------------------------|
| Menu | Description                   | Notes                                                           |
|------+-------------------------------+-----------------------------------------------------------------|
| M+   | Add a new measurement         |                                                                 |
| M-   | Delete last measurement       |                                                                 |
| ---  |                               |                                                                 |
| REP  | Display Report                | Reports μ & kuN or MID & kuS depending on distribution          |
| ---  |                               |                                                                 |
| CLRM | Clear all measurements        |                                                                 |
|------+-------------------------------+-----------------------------------------------------------------|
| μ    | Arithmetic Mean               | Normal Errors: Measurement estimate                             |
| kuN  | k*PSD                         | Normal Errors: Expanded uncertainty estimate                    |
| MID  | (MAX+MIN)/2                   | Rectangular (Square) Errors: Measurement estimate               |
| kuS  | k*RNG/2/SQRT(3)               | Rectangular (Square) Errors: Expanded uncertainty estimate      |
| MIN  | Minimum value                 |                                                                 |
| MAX  | Maximum value                 |                                                                 |
|------+-------------------------------+-----------------------------------------------------------------|
| SD   | Standard Deviation            |                                                                 |
| PSD  | Population Standard Deviation | This is the one with n-1 on the bottom                          |
| RNG  | Range                         | MAX-MIN                                                         |
| SqVA | Rectangular (Square) Variance | (MAX-MIN)/(2*sqrt(3))                                           |
| N    | Number of measurements        | Number of rows in MeDAT                                         |
| SUMS | Y: Sum Squared X: Sum         |                                                                 |
| ---  |                               |                                                                 |
|------+-------------------------------+-----------------------------------------------------------------|
| D=?  | Distribution                  | Cycle between N=Normal & S=Rectangular (Square).  Defaults k.   |
| k=NN | Coverage Factor               | Cycle through predefined values for distribution                |
| A=NN | Auto Report Count             | Automatically generate a report when N measurements are entered |
|------+-------------------------------+-----------------------------------------------------------------|

* Use

In use the application is quite like the built in statistics application in that =[M+]= & =[M+]= add and delete measurements.  All measurements are stored in
a matrix named =MeDAT=.  Feel free to edit this matrix with the =MATRIX= menu.

The =[REP]= key will generate a report.  Reports can also be generated automatically when a set number of measurements have been entered (see the setup menu).

Menu page two & three compute various statistics useful for uncertainty reporting.  Page two has the most common statistics, and page three is more useful for
custom uncertainty computations.

Menu page four is for setup.  The distribution impacts reporting (menu page one: =[REP]=).  The coverage factor impacts reporting (menu page one: =[REP]=) and
and the expanded uncertainty computations (menu page two: =[kuN]= & =[kuS]=).  The automatic reporting option impacts the add measurement function (menu page
one: =[M+]=) such that a report is automatically generated when a specified number of measurements have been entered.

* Future

Some things I might do some day...

 - I stored all the data in a matrix because I was thinking about adding rank statistics and a graphics
 - A graphical representation showing the points and various confidence intervals would be cool
 - It would be neat to see a live dot plot of the measurements as they are being entered
 - Arbitrary k values
 - Support the larger screen when running on the DM42
 - Make the sub-functions perfect (i.e. minimally alter stack/last X)
 - Make the setup menu not alter the stack
 - Add a printed report listing data and both normal & square estimates for all coverage factors

