docs/meas.html

<div id="outline-container-org6b89740" class="outline-2">
<h2 id="org6b89740"><span class="section-number-2">5</span> Reporting</h2>
<div class="outline-text-2" id="text-5">
<p>
I find that most of the time I use units such that measurements integer values.  For example with paper thickness measurements I will use micrometers in a
range between 700 and 1100.  For other philatelic applications I may use millimeters with one or, rarely, two decimals.  For these applications it is possible
to fit the measurement value, uncertainty, max, and min all on the screen at once assuming <code>FIX</code> has been set appropriately.  The report function attempts to
use this compact reporting method if possible.  Otherwise it uses the first line for the measurement estimate and the second line for the expanded
uncertainty.
</p>

<p>
The measurement and expanded uncertainty are reported according to the selected of distribution and coverage factor.  See the setup menu.
</p>

<p>
Reports can be automatically generated upon entry of a configurable number of measurements.  See the setup menu.
</p>
</div>
</div>

<div id="outline-container-orgc30f56a" class="outline-2">
<h2 id="orgc30f56a"><span class="section-number-2">6</span> Application Menu</h2>
<div class="outline-text-2" id="text-6">
<table id="orgce2295b" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M+</td>
<td class="org-left">Add a new measurement</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">M-</td>
<td class="org-left">Delete last measurement</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">---</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">REP</td>
<td class="org-left">Display Report</td>
<td class="org-left">Reports μ &amp; kuN or MID &amp; kuS depending on distribution</td>
</tr>

<tr>
<td class="org-left">---</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CLRM</td>
<td class="org-left">Clear all measurements</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">μ</td>
<td class="org-left">Arithmetic Mean</td>
<td class="org-left">Normal Errors: Measurement estimate</td>
</tr>

<tr>
<td class="org-left">kuN</td>
<td class="org-left">k*PSD</td>
<td class="org-left">Normal Errors: Expanded uncertainty estimate</td>
</tr>

<tr>
<td class="org-left">MID</td>
<td class="org-left">(MAX+MIN)/2</td>
<td class="org-left">Rectangular (Square) Errors: Measurement estimate</td>
</tr>

<tr>
<td class="org-left">kuS</td>
<td class="org-left">k*RNG/2/SQRT(3)</td>
<td class="org-left">Rectangular (Square) Errors: Expanded uncertainty estimate</td>
</tr>

<tr>
<td class="org-left">MIN</td>
<td class="org-left">Minimum value</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">MAX</td>
<td class="org-left">Maximum value</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SD</td>
<td class="org-left">Standard Deviation</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PSD</td>
<td class="org-left">Population Standard Deviation</td>
<td class="org-left">This is the one with n-1 on the bottom</td>
</tr>

<tr>
<td class="org-left">RNG</td>
<td class="org-left">Range</td>
<td class="org-left">MAX-MIN</td>
</tr>

<tr>
<td class="org-left">SqVA</td>
<td class="org-left">Rectangular (Square) Variance</td>
<td class="org-left">(MAX-MIN)/(2*sqrt(3))</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left">Number of measurements</td>
<td class="org-left">Number of rows in MeDAT</td>
</tr>

<tr>
<td class="org-left">SUMS</td>
<td class="org-left">Y: Sum Squared X: Sum</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">---</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">D=?</td>
<td class="org-left">Distribution</td>
<td class="org-left">Cycle between N=Normal &amp; S=Rectangular (Square).  Defaults k.</td>
</tr>

<tr>
<td class="org-left">k=NN</td>
<td class="org-left">Coverage Factor</td>
<td class="org-left">Cycle through predefined values for distribution</td>
</tr>

<tr>
<td class="org-left">A=NN</td>
<td class="org-left">Auto Report Count</td>
<td class="org-left">Automatically generate a report when N measurements are entered</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org63e9554" class="outline-2">
<h2 id="org63e9554"><span class="section-number-2">7</span> Use</h2>
<div class="outline-text-2" id="text-7">
<p>
In use the application is quite like the built in statistics application in that <code>[M+]</code> &amp; <code>[M+]</code> add and delete measurements.  All measurements are stored in
a matrix named <code>MeDAT</code>.  Feel free to edit this matrix with the <code>MATRIX</code> menu.
</p>

<p>
The <code>[REP]</code> key will generate a report.  Reports can also be generated automatically when a set number of measurements have been entered (see the setup menu).
</p>

<p>
Menu page two &amp; three compute various statistics useful for uncertainty reporting.  Page two has the most common statistics, and page three is more useful for
custom uncertainty computations.
</p>

<p>
Menu page four is for setup.  The distribution impacts reporting (menu page one: <code>[REP]</code>).  The coverage factor impacts reporting (menu page one: <code>[REP]</code>) and
and the expanded uncertainty computations (menu page two: <code>[kuN]</code> &amp; <code>[kuS]</code>).  The automatic reporting option impacts the add measurement function (menu page
one: <code>[M+]</code>) such that a report is automatically generated when a specified number of measurements have been entered.
</p>
</div>
</div>

<div id="outline-container-org467db72" class="outline-2">
<h2 id="org467db72"><span class="section-number-2">8</span> Future</h2>
<div class="outline-text-2" id="text-8">
<p>
Some things I might do some day&#x2026;
</p>

<ul class="org-ul">
<li>I stored all the data in a matrix because I was thinking about adding rank statistics and a graphics</li>
<li>A graphical representation showing the points and various confidence intervals would be cool</li>
<li>It would be neat to see a live dot plot of the measurements as they are being entered</li>
<li>Arbitrary k values</li>
<li>Support the larger screen when running on the DM42</li>
<li>Make the sub-functions perfect (i.e. minimally alter stack/last X)</li>
<li>Make the setup menu not alter the stack</li>
<li>Add a printed report listing data and both normal &amp; square estimates for all coverage factors</li>
</ul>
</div>
</div>
