src/meas.org
* The Code

#+begin_src hp42s :tangle ../src_42s/meas/meas.hp42s
@@@@ Repeated Measurements
@@@@ IN:  N/A
@@@@ OUT: N/A
@@@@ UPD: 2021-02-24
@@@@ BUG: Settings menu messes with the stack
@@@@ GBL: MeDAT -- Measurement Matrix
@@@@ GBL: MeDST -- Error Distribution
@@@@ GBL: MeCFA -- Coverage Factor
@@@@ GBL: MeTGN -- Target Measurement Count (generates a report automatically)
@@@@ TST: free42 3.0.2
LBL "MEAS"
@@@@ Initialize setup variables
0
SF 25
RCL "MeDST"
FC?C 25
STO "MeDST"
SF 25
RCL "MeCFA"
FC?C 25
STO "MeCFA"
SF 25
RCL "MeTGN"
FC?C 25
STO "MeTGN"
R↓
@@@@ Menu Setup
LBL 01               @@@@ Page 1 of menu MEAS
CLMENU
"M+"
KEY 1 XEQ 05
"M-"
KEY 2 XEQ 06
"REP"
KEY 4 XEQ 07
"CLRM"
KEY 6 XEQ 08
KEY 7 GTO 04
KEY 8 GTO 02
KEY 9 GTO 00
MENU
STOP
GTO 01
LBL 02               @@@@ Page 2 of menu MEAS
CLMENU
"μ"
KEY 1 XEQ 09
"kuN"
KEY 2 XEQ 10
"MID"
KEY 3 XEQ 11
"kuS"
KEY 4 XEQ 12
"MIN"
KEY 5 XEQ 13
"MAX"
KEY 6 XEQ 14
KEY 7 GTO 01
KEY 8 GTO 03
KEY 9 GTO 00
MENU
STOP
GTO 02
LBL 03               @@@@ Page 3 of menu MEAS
CLMENU
"SD"
KEY 1 XEQ 15
"PSD"
KEY 2 XEQ 16
"RNG"
KEY 3 XEQ 17
"SqVA"
KEY 4 XEQ 35
"N"
KEY 5 XEQ 18
"SUMS"
KEY 6 XEQ 19
KEY 7 GTO 02
KEY 8 GTO 04
KEY 9 GTO 00
MENU
STOP
GTO 03
LBL 04               @@@@ Page 4 of menu MEAS
CLMENU
XEQ 55
KEY 2 XEQ 21
XEQ 56
KEY 3 XEQ 22
KEY 7 GTO 03
KEY 8 GTO 01
KEY 9 GTO 00
MENU
STOP
GTO 04
LBL 00
EXITALL
RTN
@@@@ Menu Actions
LBL 05               @@@@ Action for menu key M+
FUNC 00
REAL?
GTO 34
"ERR: Bad Value"
AVIEW
RTN
LBL 34
SF 25                @@@@ Index & grow MeDAT
INDEX "MeDAT"
FS?C 25
GTO 33
1
1
DIM "MeDAT"
INDEX "MeDAT"
R↓
R↓
STOEL
VIEW "MeDAT"
RTN
LBL 33               @@@@ MeDAT exists.  Grow it
GROW
J-
J+
WRAP
STOEL                @@@@ Store element at new location
XEQ 18
RCL "MeTGN"
X≠Y?
GTO 43
XEQ 07
RTN
LBL 43
VIEW "MeDAT"
RTN
LBL 06               @@@@ Action for menu key M-
FUNC 00
SF 25                @@@@ Index & grow MeDAT
INDEX "MeDAT"
FC?C 25
RTN                  @@@@ MeDAT is missing
J-
RCLEL
DELR
VIEW "MeDAT"
RTN
LBL 07               @@@@ Action for menu key REP
FUNC 00
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
R↓
RCL "MeDST"
X=0?                 @@@@ IF-BEGIN
GTO 39
GTO 40
LBL 39               @@@@ IF-THEN normal
"μ="
XEQ 09
ARCL ST X
├" "
RCL "MeCFA"
70
+
XEQ IND ST X
├"×u="
XEQ 10
ARCL ST X
GTO 41
LBL 40               @@@@ IF-ELSE square
"C="
XEQ 11
ARCL ST X
├" "
RCL "MeCFA"
70
+
XEQ IND ST X
├"×u="
XEQ 12
ARCL ST X
LBL 41               @@@@ IF-END
ALENG
21
X<Y?                 @@@@ Can we keep going with 4 value report?
GTO 36
├"[LF]↓="
XEQ 13
ARCL ST X
├"  ↑="
XEQ 14
ARCL ST X
ALENG
41
X<Y?                 @@@@ Can we keep going with 4 value report?
GTO 36
AVIEW
RTN
LBL 36               @@@@ 2 value report
RCL "MeDST"
X=0?                 @@@@ IF-BEGIN
GTO 37
GTO 38
LBL 37               @@@@ IF-THEN normal
R↓
" μ="
XEQ 09
ARCL ST X
├"[LF]"
RCL "MeCFA"
70
+
XEQ IND ST X
├"×u="
XEQ 10
ARCL ST X
GTO 39
LBL 38               @@@@ IF-ELSE square
R↓
" C="
XEQ 11
ARCL ST X
├"[LF]"
RCL "MeCFA"
70
+
XEQ IND ST X
├"×u="
XEQ 12
ARCL ST X
LBL 39               @@@@ IF-END
AVIEW
RTN
LBL 08               @@@@ Action for menu key CLRM
FUNC 00
SF 25
INDEX "MeDAT"
CLV "MeDAT"
CF 25
"MeDAT Cleared"
AVIEW
RTN
LBL 09               @@@@ Action for menu key μ (mean)
FUNC 01
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
XEQ 19
X<>Y
R↓
XEQ 18
÷
RTN
LBL 10               @@@@ Action for menu key kuN (expanded uncertainty for normally distributed data)
FUNC 01
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
XEQ 16
RCL "MeCFA"
60
+
XEQ IND ST X
X<>Y
R↓
×
RTN
LBL 11               @@@@ Action for menu key MID (midrange)
FUNC 01
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
XEQ 14
XEQ 13
+
2
÷
RTN
LBL 12               @@@@ Action for menu key kuS (expanded uncertainty for rectangular distributed data)
FUNC 01
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
XEQ 35
RCL "MeCFA"
60
+
XEQ IND ST X
X<>Y
R↓
×
RTN
LBL 35               @@@@ Action for menu key SqVA
FUNC 0
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
XEQ 17
2
÷
3
SQRT
÷
RTN
LBL 13               @@@@ Action for menu key MIN
FUNC 01
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
[MIN]
X<>Y
R↓
RTN
LBL 14               @@@@ Action for menu key MAX
FUNC 01
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
[MAX]
X<>Y
R↓
RTN
LBL 15               @@@@ Action for menu key SD
FUNC 01
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
XEQ 19
XEQ 18
X<>Y
X↑2
RCL÷ ST Y
RCL÷ ST Y
RCL ST Z
RCL ST Z
÷
X<>Y
-
SQRT
RTN
LBL 16               @@@@ Action for menu key PSD
FUNC 01
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
XEQ 19
XEQ 18
X<>Y
X↑2
RCL÷ ST Y
RCL ST Z
X<>Y
-
X<>Y
1
-
÷
SQRT
X<>Y
R↓
RTN
LBL 17               @@@@ Action for menu key RNG
FUNC 01
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
XEQ 14
XEQ 13
-
RTN
LBL 18               @@@@ Action for menu key N
FUNC 01
SF 25
RCL "MeDAT"
FS?C 25
GTO 54
0
RTN
LBL 54
DIM?
R↓
RTN
LBL 19               @@@@ Action for menu key SUMS
FUNC 02
SF 25
INDEX "MeDAT"
FC?C 25
GTO 99
0
0
LBL 32
RCLEL
STO+ ST Y
X↑2
STO+ ST Z
R↓
J+
FC? 77
GTO 32
RTN
LBL 20               @@@@ Action for menu key D:
FUNC 00
1
RCL+ "MeDST"
2
MOD
STO "MeDST"
R↓
0
STO "MeCFA"
R↓
RTN
LBL 21               @@@@ Action for menu key k:
FUNC 00
1
RCL+ "MeCFA"
RCL "MeDST"
X=0?
GTO 29
GTO 30
LBL 29
4
GTO 31
LBL 30
2
LBL 31
X<>Y
R↓
MOD
STO "MeCFA"
R↓
RTN
LBL 22               @@@@ Action for menu key A:
FUNC 00
1
X≠Y?
GTO 42
"ERR: Bad Value"
AVIEW
RTN
LBL 42
R↓
STO "MeTGN"
RTN
@@@@ Coverage values
LBL 60               @@@@ Value for coverage factor 0
1
RTN
LBL 61               @@@@ Value for coverage factor 1
RCL "MeDST"
X=0?
GTO 24
R↓
2
RTN
LBL 24
R↓
3
SQRT
RTN
LBL 62               @@@@ Value for coverage factor 2
3
RTN
LBL 63               @@@@ Value for coverage factor 3
4
RTN
@@@@ Coverage Names
LBL 70               @@@@ Name for coverage factor 0
├"1"
RTN
LBL 71               @@@@ Name for coverage factor 1
RCL "MeDST"
X=0?
├"2"
X≠0?
├"√3"
R↓
RTN
LBL 72               @@@@ Name for coverage factor 2
├"3"
RTN
LBL 73               @@@@ Name for coverage factor 3
├"4"
RTN
@@@@ distribution Names
LBL 80               @@@@ Name for distribution 0
├"N"
RTN
LBL 81               @@@@ Name for distribution 1
├"S"
RTN
@@@@ Error States
LBL 99               @@@@ ERROR message for missing MeDAT
"ERR: No MeDAT"
AVIEW
RTN
LBL 55
FUNC 00
"D:"
RCL "MeDST"
80
+
XEQ IND ST X
R↓
KEY 1 XEQ 20
"k:"
RCL "MeCFA"
70
+
XEQ IND ST X
R↓
RTN
LBL 56
FUNC 00
"A:"
RCL "MeTGN"
X=0?
├"-"
X≠0?
AIP
R↓
RTN
END
#+end_src

