docs/meas.html

<div id="outline-container-org21c788e" class="outline-2">
<h2 id="org21c788e"><span class="section-number-2">9</span> The Code</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-hp42s"><span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Repeated Measurements</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IN:  N/A</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">OUT: N/A</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">UPD: 2021-02-24</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">BUG: Settings menu messes with the stack</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: MeDAT -- Measurement Matrix</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: MeDST -- Error Distribution</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: MeCFA -- Coverage Factor</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">GBL: MeTGN -- Target Measurement Count (generates a report automatically)</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: free42 3.0</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">TST: DM42 DMCP-3.20 / DM42-3.17</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #fa8072;">"MEAS"</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Initialize setup variables</span>
0
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeDST"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"MeDST"</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeCFA"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"MeCFA"</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeTGN"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"MeTGN"</span>
R&#8595;
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Menu Setup</span>
<span style="color: #00ffff;">LBL</span> 01               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 1 of menu MEAS</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"M+"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 05
<span style="color: #fa8072;">"M-"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 06
<span style="color: #fa8072;">"REP"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 07
<span style="color: #fa8072;">"CLRM"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 08
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 04
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">LBL</span> 02               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 2 of menu MEAS</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"&#956;"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 09
<span style="color: #fa8072;">"kuN"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 10
<span style="color: #fa8072;">"MID"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 11
<span style="color: #fa8072;">"kuS"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 12
<span style="color: #fa8072;">"MIN"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 13
<span style="color: #fa8072;">"MAX"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 14
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">LBL</span> 03               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 3 of menu MEAS</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"SD"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 15
<span style="color: #fa8072;">"PSD"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 16
<span style="color: #fa8072;">"RNG"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 17
<span style="color: #fa8072;">"SqVA"</span> 
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> 35
<span style="color: #fa8072;">"N"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> 18
<span style="color: #fa8072;">"SUMS"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> 19
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 02
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 04
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">LBL</span> 04               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Page 4 of menu MEAS</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"D:"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeDST"</span>
80
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">XEQ IND ST</span> X
R&#8595;
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> 20
<span style="color: #fa8072;">"k:"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeCFA"</span>
70
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">XEQ IND ST</span> X
R&#8595;
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> 21
<span style="color: #fa8072;">"A:"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeTGN"</span>
<span style="color: #00ffff;">X=0</span>?
&#9500;<span style="color: #fa8072;">"-"</span>
<span style="color: #00ffff;">X&#8800;0</span>?
<span style="color: #00ffff;">AIP</span>
R&#8595;
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> 22
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> 03
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> 01
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> 00
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> 04
<span style="color: #00ffff;">LBL</span> 00
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Menu Actions</span>
<span style="color: #00ffff;">LBL</span> 05               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key M+</span>
<span style="color: #00ffff;">REAL</span>?
<span style="color: #00ffff;">GTO</span> 34
<span style="color: #fa8072;">"ERR: Bad Value"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 34
<span style="color: #00ffff;">SF</span> 25                <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Index &amp; grow MeDAT</span>
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">GTO</span> 33
1
1
<span style="color: #00ffff;">DIM</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
R&#8595;
R&#8595;
<span style="color: #00ffff;">STOEL</span>
<span style="color: #00ffff;">VIEW</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 33               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">MeDAT exists.  Grow it</span>
<span style="color: #00ffff;">GROW</span>
<span style="color: #00ffff;">J-</span>
<span style="color: #00ffff;">J+</span>
<span style="color: #00ffff;">WRAP</span>
<span style="color: #00ffff;">STOEL</span>                <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Store element at new location</span>
<span style="color: #00ffff;">XEQ</span> 18
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeTGN"</span>
<span style="color: #00ffff;">X&#8800;Y</span>?
<span style="color: #00ffff;">GTO</span> 43
<span style="color: #00ffff;">XEQ</span> 07
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 43
<span style="color: #00ffff;">VIEW</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 06               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key M-</span>
<span style="color: #00ffff;">SF</span> 25                <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Index &amp; grow MeDAT</span>
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">RTN</span>                  <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">MeDAT is missing</span>
<span style="color: #00ffff;">J-</span>
<span style="color: #00ffff;">RCLEL</span>
<span style="color: #00ffff;">DELR</span>
<span style="color: #00ffff;">VIEW</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 07               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key REP</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
R&#8595;
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeDST"</span>
<span style="color: #00ffff;">X=0</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-BEGIN</span>
<span style="color: #00ffff;">GTO</span> 39
<span style="color: #00ffff;">GTO</span> 40
<span style="color: #00ffff;">LBL</span> 39               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-THEN normal</span>
<span style="color: #fa8072;">"&#956;="</span>
<span style="color: #00ffff;">XEQ</span> 09
<span style="color: #00ffff;">ARCL</span> ST X
&#9500;<span style="color: #fa8072;">" ku="</span>
<span style="color: #00ffff;">XEQ</span> 10
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">GTO</span> 41
<span style="color: #00ffff;">LBL</span> 40               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-ELSE square</span>
<span style="color: #fa8072;">"C="</span>
<span style="color: #00ffff;">XEQ</span> 11
<span style="color: #00ffff;">ARCL</span> ST X
&#9500;<span style="color: #fa8072;">" ku="</span>
<span style="color: #00ffff;">XEQ</span> 12
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">LBL</span> 41               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-END</span>
<span style="color: #00ffff;">ALENG</span>
21
<span style="color: #00ffff;">X&lt;Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Can we keep going with 4 value report?</span>
<span style="color: #00ffff;">GTO</span> 36
&#9500;<span style="color: #fa8072;">"[LF]&#8595;="</span>
<span style="color: #00ffff;">XEQ</span> 13
<span style="color: #00ffff;">ARCL</span> ST X
&#9500;<span style="color: #fa8072;">"  &#8593;="</span>
<span style="color: #00ffff;">XEQ</span> 14
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">ALENG</span>
41
<span style="color: #00ffff;">X&lt;Y</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Can we keep going with 4 value report?</span>
<span style="color: #00ffff;">GTO</span> 36
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 36               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">2 value report</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeDST"</span>
<span style="color: #00ffff;">X=0</span>?                 <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-BEGIN</span>
<span style="color: #00ffff;">GTO</span> 37
<span style="color: #00ffff;">GTO</span> 38
<span style="color: #00ffff;">LBL</span> 37               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-THEN normal</span>
R&#8595;
<span style="color: #fa8072;">" &#956;="</span>
<span style="color: #00ffff;">XEQ</span> 09
<span style="color: #00ffff;">ARCL</span> ST X
&#9500;<span style="color: #fa8072;">"[LF]ku="</span>
<span style="color: #00ffff;">XEQ</span> 10
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">GTO</span> 39
<span style="color: #00ffff;">LBL</span> 38               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-ELSE square</span>
R&#8595;
<span style="color: #fa8072;">" C="</span>
<span style="color: #00ffff;">XEQ</span> 11
<span style="color: #00ffff;">ARCL</span> ST X
&#9500;<span style="color: #fa8072;">"[LF]ku="</span>
<span style="color: #00ffff;">XEQ</span> 12
<span style="color: #00ffff;">ARCL</span> ST X
<span style="color: #00ffff;">LBL</span> 39               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">IF-END</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 08               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key CLRM</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">CLV</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">CF</span> 25
<span style="color: #fa8072;">"MeDAT Cleared"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 09               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key &#956; (mean)</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
<span style="color: #00ffff;">XEQ</span> 19
<span style="color: #00ffff;">X&lt;&gt;Y</span>
R&#8595;
<span style="color: #00ffff;">XEQ</span> 18
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 10               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key kuN (expanded uncertainty for normally distributed data)</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
<span style="color: #00ffff;">XEQ</span> 16
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeCFA"</span>
60
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">XEQ IND ST</span> X
<span style="color: #00ffff;">X&lt;&gt;Y</span>
R&#8595;
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 11               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key MID (midrange)</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
<span style="color: #00ffff;">XEQ</span> 14
<span style="color: #00ffff;">XEQ</span> 13
<span style="color: #00ffff;">+</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 12               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key kuS (expanded uncertainty for rectangular distributed data)</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
<span style="color: #00ffff;">XEQ</span> 35
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeCFA"</span>
60
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">XEQ IND ST</span> X
<span style="color: #00ffff;">X&lt;&gt;Y</span>
R&#8595;
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 35               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for SqVA</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
<span style="color: #00ffff;">XEQ</span> 17
2
<span style="color: #00ffff;">&#247;</span>
3
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 13               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key MIN</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
[MIN]
<span style="color: #00ffff;">X&lt;&gt;Y</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 14               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key MAX</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
[MAX]
<span style="color: #00ffff;">X&lt;&gt;Y</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 15               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key SD</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
<span style="color: #00ffff;">XEQ</span> 19
<span style="color: #00ffff;">XEQ</span> 18
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">X&#8593;2</span>
<span style="color: #00ffff;">RCL&#247; ST</span> Y
<span style="color: #00ffff;">RCL&#247; ST</span> Y
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 16               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key PSD</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
<span style="color: #00ffff;">XEQ</span> 19   
<span style="color: #00ffff;">XEQ</span> 18   
<span style="color: #00ffff;">X&lt;&gt;Y</span>     
<span style="color: #00ffff;">X&#8593;2</span>      
<span style="color: #00ffff;">RCL&#247; ST</span> Y
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">X&lt;&gt;Y</span> 
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
1
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 17               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key RNG</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
<span style="color: #00ffff;">XEQ</span> 14
<span style="color: #00ffff;">XEQ</span> 13
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 18               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key N</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FS?C</span> 25
<span style="color: #00ffff;">GTO</span> 54
0
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 54
<span style="color: #00ffff;">DIM</span>? 
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 19               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key SUMS</span>
<span style="color: #00ffff;">SF</span> 25
<span style="color: #00ffff;">INDEX</span> <span style="color: #fa8072;">"MeDAT"</span>
<span style="color: #00ffff;">FC?C</span> 25
<span style="color: #00ffff;">GTO</span> 99
0
0
<span style="color: #00ffff;">LBL</span> 32
<span style="color: #00ffff;">RCLEL</span>
<span style="color: #00ffff;">STO+ ST</span> Y
<span style="color: #00ffff;">X&#8593;2</span>
<span style="color: #00ffff;">STO+ ST</span> Z
R&#8595;
<span style="color: #00ffff;">J+</span>
<span style="color: #00ffff;">FC</span>? 77
<span style="color: #00ffff;">GTO</span> 32
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 20               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key D:</span>
1
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"MeDST"</span>
2
<span style="color: #00ffff;">MOD</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"MeDST"</span>
R&#8595;
0
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"MeCFA"</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 21               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key k:</span>
1
<span style="color: #00ffff;">RCL+</span> <span style="color: #fa8072;">"MeCFA"</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeDST"</span>
<span style="color: #00ffff;">X=0</span>?
<span style="color: #00ffff;">GTO</span> 29
<span style="color: #00ffff;">GTO</span> 30
<span style="color: #00ffff;">LBL</span> 29
4
<span style="color: #00ffff;">GTO</span> 31
<span style="color: #00ffff;">LBL</span> 30
2
<span style="color: #00ffff;">LBL</span> 31
<span style="color: #00ffff;">X&lt;&gt;Y</span>
R&#8595;
<span style="color: #00ffff;">MOD</span>
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"MeCFA"</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 22               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Action for menu key A:</span>
1
<span style="color: #00ffff;">X&#8800;Y</span>?
<span style="color: #00ffff;">GTO</span> 42
<span style="color: #fa8072;">"ERR: Bad Value"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 42
R&#8595;
<span style="color: #00ffff;">STO</span> <span style="color: #fa8072;">"MeTGN"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Coverage values</span>
<span style="color: #00ffff;">LBL</span> 60               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Value for coverage factor 0</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 61               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Value for coverage factor 1</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeDST"</span>
<span style="color: #00ffff;">X=0</span>?
<span style="color: #00ffff;">GTO</span> 24
R&#8595;
2
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 24
R&#8595;
3
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 62               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Value for coverage factor 2</span>
3
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 63               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Value for coverage factor 3</span>
4
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Coverage Names</span>
<span style="color: #00ffff;">LBL</span> 70               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Name for coverage factor 0</span>
&#9500;<span style="color: #fa8072;">"1"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 71               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Name for coverage factor 1</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"MeDST"</span>
<span style="color: #00ffff;">X=0</span>?
&#9500;<span style="color: #fa8072;">"2"</span>
<span style="color: #00ffff;">X&#8800;0</span>?
&#9500;<span style="color: #fa8072;">"&#8730;3"</span>
R&#8595;
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 72               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Name for coverage factor 2</span>
&#9500;<span style="color: #fa8072;">"3"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 73               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Name for coverage factor 3</span>
&#9500;<span style="color: #fa8072;">"4"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">distribution Names</span>
<span style="color: #00ffff;">LBL</span> 80               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Name for distribution 0</span>
&#9500;<span style="color: #fa8072;">"N"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> 81               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Name for distribution 1</span>
&#9500;<span style="color: #fa8072;">"S"</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">Error States</span>
<span style="color: #00ffff;">LBL</span> 99               <span style="color: #ffa500;">@@@@ </span><span style="color: #ff7f24;">ERROR message for missing MeDAT</span>
<span style="color: #fa8072;">"ERR: No MeDAT"</span>
<span style="color: #00ffff;">AVIEW</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">END</span>
</pre>
</div>
</div>
</div>
